tap "hashicorp/tap"
tap "jwbargsten/misc"
tap "warpdotdev/warp"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Ping, but with a graph
brew "gping"
# Curl statistics made simple
brew "httpstat"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tool for calculation of IP networks
brew "ipinfo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Show markdown documents on text terminals
brew "mdcat"
# Modern and intuitive terminal-based text editor
brew "micro"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# Port scanning utility for large networks
brew "nmap"
# Create, run, and share large language models (LLMs)
brew "ollama"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Paste PNG into files
brew "pngpaste"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Modern Day Portscanner
brew "rustscan"
# Display and control your Android device
brew "scrcpy"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Non-interactive SSH password auth
brew "sshpass"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Internet file retriever
brew "wget"
# Lookup tool for domain names and other internet resources
brew "whois"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Terraform
brew "hashicorp/tap/terraform"
# Set the default browser from command-line
brew "jwbargsten/misc/defbro"
# Image editing and design software
cask "affinity"
# Android SDK component
cask "android-platform-tools"
# AI Coding Agent IDE
cask "antigravity"
# Temporary notes with calculations and extensible features
cask "antinote"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Scriptable scratchpad for developers
cask "boop"
# UI for creating Windows installer ISO from UUPDump
cask "crystalfetch"
# Disk space visualiser
cask "daisydisk"
# Voice and text chat software
cask "discord"
# Run Stable Diffusion locally
cask "draw-things"
# Software custom-built for content creation
cask "elgato-wave-link"
# Launcher for *Epic Games* games
cask "epic-games"
cask "font-symbols-only-nerd-font"
# Free and open-source image editor
cask "gimp"
# Extensible, firefox-based web browser
cask "glide-browser"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Vector graphics editor
cask "inkscape"
# File archiver
cask "keka"
# App providing offline access to Wikipedia and many other web sites
cask "kiwix"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge@beta"
# Neovim Client
cask "neovide-app"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# G-code generator for 3D printers
cask "orcaslicer"
# Command palette in any application
cask "paletro"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Command-line shell and scripting language
cask "powershell"
# Companion app for Flipper Zero devices
cask "qflipper"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Window snapping tool
cask "rectangle-pro"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Command-line interface to Warp agents
cask "warp-cli@preview"
# Rust-based terminal
cask "warp@preview"
# Connect to Windows
cask "windows-app"
# Video communication and virtual meeting platform
cask "zoom"
mas "1001 Record", id: 6451834996
mas "Developer", id: 640199958
mas "JobSnail", id: 6449959070
mas "RunCat", id: 1429033973
mas "Swift Playground", id: 1496833156
mas "Virtual Snow", id: 6747272596
mas "Xcode", id: 497799835
vscode "ecmel.vscode-html-css"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.powershell"
vscode "swiftlang.swift-vscode"
vscode "xdebug.php-pack"
vscode "zobo.php-intellisense"
