tap "hashicorp/tap"
tap "jwbargsten/misc"
tap "krishkrosh/apps"
tap "slp/krunkit"
brew "python@3.14"
brew "tree"
brew "ansible"
brew "bat"
brew "bpytop"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "displayplacer"
brew "docker"
brew "fastfetch"
brew "fd"
brew "ffmpegthumbnailer"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "glab"
brew "glow"
brew "go"
brew "gping"
brew "httpstat"
brew "imagemagick"
brew "ipinfo"
brew "jq"
brew "mas"
brew "mdcat"
brew "micro"
brew "neovim"
brew "nmap"
brew "nvm"
brew "ollama"
brew "pipx"
brew "pkgconf"
brew "pngpaste"
brew "podman"
brew "poppler"
brew "qemu"
brew "ripgrep"
brew "rustscan"
brew "scrcpy"
brew "sevenzip"
brew "sox"
brew "speedtest-cli"
brew "sshpass"
brew "switchaudio-osx"
brew "telnet"
brew "testssl"
brew "tmux"
brew "wget"
brew "whois"
brew "yazi"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "jwbargsten/misc/defbro"
brew "slp/krunkit/krunkit"
cask "balenaetcher"
cask "boop"
cask "crystalfetch"
cask "cursor-cli"
cask "daisydisk"
cask "elgato-wave-link"
cask "font-symbols-only-nerd-font"
cask "gimp"
cask "github"
cask "glide-browser"
cask "google-drive"
cask "inkscape"
cask "keepassxc"
cask "keka"
cask "logi-options+"
cask "microsoft-auto-update"
cask "microsoft-edge@beta"
cask "neovide-app"
cask "obs"
cask "obsidian"
cask "omnissa-horizon-client"
cask "orcaslicer"
cask "podman-desktop"
cask "powershell"
cask "raycast"
cask "rectangle-pro"
cask "slack"
cask "spotify"
cask "stats"
cask "tailscale-app"
cask "teamviewer"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "warp@preview"
cask "windows-app"
cask "zen"
cask "zoom"
mas "RunCat", id: 1429033973
mas "Virtual Snow", id: 6747272596
mas "Yubico Authenticator", id: 1497506650
