tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
brew "aztfexport"
brew "azure-cli"
brew "bpytop"
brew "fastfetch"
brew "gettext"
brew "gping"
brew "httpstat"
brew "ipinfo"
brew "lazygit"
brew "libgpg-error"
brew "micro"
brew "neofetch"
brew "nethack"
brew "nmap"
brew "node"
brew "open-adventure"
brew "pinentry-mac"
brew "pipx"
brew "rustscan"
brew "speedtest-cli"
brew "subversion"
brew "switchaudio-osx"
brew "wget"
brew "whois"
brew "hashicorp/tap/terraform"
cask "android-studio"
cask "balenaetcher"
cask "boop"
cask "clipy"
cask "crystalfetch"
cask "devtoys"
cask "gimp"
cask "github"
cask "google-chrome"
cask "keeper-password-manager"
cask "keycastr"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-edge@beta"
cask "microsoft-edge@dev"
cask "microsoft-office-businesspro"
cask "multipass"
cask "notunes"
cask "nperf"
cask "obs"
cask "openvpn-connect"
cask "parallels"
cask "postman"
cask "powershell"
cask "rapidapi"
cask "raspberry-pi-imager"
cask "raycast"
cask "rectangle-pro"
cask "spotify"
cask "stats"
cask "steam"
cask "tailscale"
cask "the-unarchiver"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zoom"
vscode "4ops.terraform"
vscode "alexisvt.flutter-snippets"
vscode "aykutsarac.jsoncrack-vscode"
vscode "azapi-vscode.azapi"
vscode "azurepolicy.azurepolicyextension"
vscode "benjaminbenais.copilot-theme"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "kevinrose.vsc-python-indent"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mathcale.theme-dracula-refined"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "qwtel.sqlite-viewer"
vscode "rogalmic.bash-debug"
vscode "run-at-scale.terraform-doc-snippets"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "zainchen.json"
